/* An error occurred when creating a new album. Please check your internet connection and try again later. */
"An error occurred when creating a new album. Please check your internet connection and try again later." = "Une erreur est survenue lors de la création d’un nouvel album. Veuillez vérifier votre connexion Internet et réessayer plus tard.";

/* An error occurred when uploading an image to Picasa Web Albums. Please check your internet connection and try again later. */
"An error occurred when uploading an image to Picasa Web Albums. Please check your internet connection and try again later." = "Une erreur est survenue lors de l’envoi d’une image vers les albums web Picasa. Veuillez vérifier votre connexion Internet et réessayer plus tard.";

/* Could not create a new album */
"Could not create a new album" = "Impossible de créer un nouvel album";

/* Could not upload an image */
"Could not upload an image" = "Impossible de télécharger une image";
